## Production: guard_duty
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**❌ &nbsp; Terraform Format:** `failed`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**🧹 &nbsp; Format:** run `terraform fmt` to fix the following: 
```sh
guard_duty.tf
```
```terraform
Plan: 6 to add, 0 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                                      NAME                                       |
|--------|---------------------------------------------------------------------------------|
| add    | `module.guard_duty.aws_cloudwatch_metric_alarm.malware_completed_scan_bytes[0]` |
|        | `module.guard_duty.aws_cloudwatch_metric_alarm.malware_completed_scan_count[0]` |
|        | `module.guard_duty.aws_guardduty_malware_protection_plan.this`                  |
|        | `module.guard_duty.aws_iam_policy.this`                                         |
|        | `module.guard_duty.aws_iam_role.this`                                           |
|        | `module.guard_duty.aws_iam_role_policy_attachment.this`                         |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.guard_duty.aws_cloudwatch_metric_alarm.malware_completed_scan_bytes[0] will be created
  + resource "aws_cloudwatch_metric_alarm" "malware_completed_scan_bytes" {
      + actions_enabled                       = true
      + alarm_description                     = "Scanned more than 2 GB in 1 day."
      + alarm_name                            = "MalwareS3-ScanBytes-forms-production-reliability-file-storage"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + dimensions                            = (known after apply)
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "CompletedScanBytes"
      + namespace                             = "AWS/GuardDuty/MalwareProtection"
      + period                                = 86400
      + statistic                             = "Sum"
      + tags_all                              = {
          + "CostCentre" = "forms-platform-production"
          + "Terraform"  = "true"
        }
      + threshold                             = 2147483648
      + treat_missing_data                    = "notBreaching"
    }

  # module.guard_duty.aws_cloudwatch_metric_alarm.malware_completed_scan_count[0] will be created
  + resource "aws_cloudwatch_metric_alarm" "malware_completed_scan_count" {
      + actions_enabled                       = true
      + alarm_description                     = "Scanned more than 10000 objects in 1 day."
      + alarm_name                            = "MalwareS3-ScanCount-forms-production-reliability-file-storage"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + dimensions                            = (known after apply)
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "CompletedScanCount"
      + namespace                             = "AWS/GuardDuty/MalwareProtection"
      + period                                = 86400
      + statistic                             = "Sum"
      + tags_all                              = {
          + "CostCentre" = "forms-platform-production"
          + "Terraform"  = "true"
        }
      + threshold                             = 10000
      + treat_missing_data                    = "notBreaching"
    }

  # module.guard_duty.aws_guardduty_malware_protection_plan.this will be created
  + resource "aws_guardduty_malware_protection_plan" "this" {
      + actions    = [
          + {
              + tagging = [
                  + {
                      + status = "ENABLED"
                    },
                ]
            },
        ]
      + arn        = (known after apply)
      + created_at = (known after apply)
      + id         = (known after apply)
      + role       = (known after apply)
      + status     = (known after apply)
      + tags       = {
          + "CostCentre" = "GCForms-production"
          + "Terraform"  = "true"
        }
      + tags_all   = {
          + "CostCentre" = "GCForms-production"
          + "Terraform"  = "true"
        }

      + protected_resource {
          + s3_bucket {
              + bucket_name     = "forms-production-reliability-file-storage"
              + object_prefixes = (known after apply)
            }
        }
    }

  # module.guard_duty.aws_iam_policy.this will be created
  + resource "aws_iam_policy" "this" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + id               = (known after apply)
      + name             = "MalwareS3-forms-production-reliability-file-storage"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "s3:PutObjectVersionTagging",
                          + "s3:PutObjectTagging",
                          + "s3:PutObject",
                          + "s3:PutBucketNotification",
                          + "s3:ListBucket",
                          + "s3:GetObjectVersionTagging",
                          + "s3:GetObjectVersion",
                          + "s3:GetObjectTagging",
                          + "s3:GetObject",
                          + "s3:GetBucketNotification",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:s3:::forms-production-reliability-file-storage/*",
                          + "arn:aws:s3:::forms-production-reliability-file-storage",
                        ]
                    },
                  + {
                      + Action    = [
                          + "events:RemoveTargets",
                          + "events:PutTargets",
                          + "events:PutRule",
                          + "events:DeleteRule",
                        ]
                      + Condition = {
                          + StringLike = {
                              + "events:ManagedBy" = "malware-protection-plan.guardduty.amazonaws.com"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "arn:aws:events:ca-central-1:957818836222:rule/DO-NOT-DELETE-AmazonGuardDutyMalwareProtectionS3*"
                    },
                  + {
                      + Action   = [
                          + "events:ListTargetsByRule",
                          + "events:DescribeRule",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:events:ca-central-1:957818836222:rule/DO-NOT-DELETE-AmazonGuardDutyMalwareProtectionS3*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags             = {
          + "CostCentre" = "GCForms-production"
          + "Terraform"  = "true"
        }
      + tags_all         = {
          + "CostCentre" = "GCForms-production"
          + "Terraform"  = "true"
        }
    }

  # module.guard_duty.aws_iam_role.this will be created
  + resource "aws_iam_role" "this" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "malware-protection-plan.guardduty.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "MalwareS3-forms-production-reliability-file-storage"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "CostCentre" = "GCForms-production"
          + "Terraform"  = "true"
        }
      + tags_all              = {
          + "CostCentre" = "GCForms-production"
          + "Terraform"  = "true"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.guard_duty.aws_iam_role_policy_attachment.this will be created
  + resource "aws_iam_role_policy_attachment" "this" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "MalwareS3-forms-production-reliability-file-storage"
    }

Plan: 6 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["module.guard_duty.aws_cloudwatch_metric_alarm.malware_completed_scan_bytes[0]"]
WARN - plan.json - main - Missing Common Tags: ["module.guard_duty.aws_cloudwatch_metric_alarm.malware_completed_scan_count[0]"]

21 tests, 19 passed, 2 warnings, 0 failures, 0 exceptions

```

</details>
